In [1]:
import pandas as pd
import numpy as np

log = pd.read_csv('log.csv.xls', encoding='utf-8', )
user = pd.read_csv('users.csv.xls', encoding='koi8_r', sep='\t')

log.columns = ['user_id', 'time', 'bet', 'win']
user.columns = ['user_id', 'email', 'geo']

def correct_id(user):
    if '#error' in user:
        return ''
    else:
        return user[user.find("user"):]
log.user_id = log.user_id.apply(correct_id)
log.time = log.time.str.replace('[', '')

In [2]:
log.head()

    user_id                 time       bet  win
0  user_973  2019-01-01 14:51:16       NaN  NaN
1  user_903  2019-01-01 16:31:16       NaN  NaN
2  user_954  2019-01-01 17:17:51       NaN  NaN
3  user_954  2019-01-01 21:31:18       NaN  NaN
4  user_917  2019-01-01 23:34:55  156789.0  NaN

In [6]:
user.head()

     Юзверь                 мейл        Гео
0  User_943  Accumanst@gmail.com     Ижевск
1  User_908    Advismowr@mail.ru     Ижевск
2  User_962      Anachso@ukr.net  Краснодар
3  User_973     Antecia@inbox.ru      Пермь
4  User_902   Balliaryva@ukr.net        NaN

In [19]:
log

      user_id                 time       bet      win
0    user_973  2019-01-01 14:51:16       NaN      NaN
1    user_903  2019-01-01 16:31:16       NaN      NaN
2    user_954  2019-01-01 17:17:51       NaN      NaN
3    user_954  2019-01-01 21:31:18       NaN      NaN
4    user_917  2019-01-01 23:34:55  156789.0      NaN
..        ...                  ...       ...      ...
994  user_984   2019-04-20 9:59:58    9754.0      NaN
995                            NaN   10054.0  29265.0
996                            NaN   10454.0      NaN
997                            NaN    1000.0      NaN
998                            NaN   10754.0      NaN

[999 rows x 4 columns]

In [47]:
def isna(col):
    c=0
    for i in log[col].isna():
        if i==True:
            c+=1
    return c
isna('time')

15

In [27]:
log.dropna(axis=0)

      user_id                 time        bet        win
13   user_917   2019-01-02 8:57:36   145732.0  1987653.0
28   user_942  2019-01-04 13:59:42  1678321.0  9876543.0
150  user_982  2019-01-16 21:54:22      100.0     4749.0
188  user_964  2019-01-21 18:34:44      200.0     4667.0
204  user_931   2019-01-22 5:26:59      300.0     4319.0
..        ...                  ...        ...        ...
966  user_975  2019-04-19 22:25:15     1000.0     6108.0
970  user_912  2019-04-20 10:35:49    10554.0    31799.0
971  user_926  2019-04-20 10:35:50    10354.0    30244.0
975  user_970  2019-04-20 10:35:54    10354.0    30691.0
990  user_965  2019-04-20 12:55:41      800.0     6927.0

[133 rows x 4 columns]

In [31]:
isna('time')

15

In [3]:
log.drop_duplicates(subset=['time', 'user_id'])

      user_id                 time       bet     win
0    user_973  2019-01-01 14:51:16       NaN     NaN
1    user_903  2019-01-01 16:31:16       NaN     NaN
2    user_954  2019-01-01 17:17:51       NaN     NaN
3    user_954  2019-01-01 21:31:18       NaN     NaN
4    user_917  2019-01-01 23:34:55  156789.0     NaN
..        ...                  ...       ...     ...
990  user_965  2019-04-20 12:55:41     800.0  6927.0
991  user_967  2019-04-20 14:59:36   10154.0     NaN
992  user_973  2019-04-20 17:09:56   10254.0     NaN
993  user_977  2019-04-20 18:10:07   10354.0     NaN
994  user_984   2019-04-20 9:59:58    9754.0     NaN

[985 rows x 4 columns]

In [81]:
log

      user_id                 time       bet      win
0    user_973  2019-01-01 14:51:16       NaN      NaN
1    user_903  2019-01-01 16:31:16       NaN      NaN
2    user_954  2019-01-01 17:17:51       NaN      NaN
3    user_954  2019-01-01 21:31:18       NaN      NaN
4    user_917  2019-01-01 23:34:55  156789.0      NaN
..        ...                  ...       ...      ...
994  user_984   2019-04-20 9:59:58    9754.0      NaN
995                            NaN   10054.0  29265.0
996                            NaN   10454.0      NaN
997                            NaN    1000.0      NaN
998                            NaN   10754.0      NaN

[999 rows x 4 columns]